Repository: pancakevirus/nim-lang-081-docs-archived
Catalog: docs/OmegaT/OmegaT-level2.tmx
Source language: en_us
Languages: ja

source: Subtract y from x.
ja: x から y を減算します。

source: Subtract a complex number from a real number.
ja: 実数から複素数を減算します。

source: Subtract a real number from a complex number.
ja: 複素数から実数を減算します。

source: Subtract two complex numbers.
ja: 複素数同士を減算します。

source: Subtracts two colors.
ja: ２色同士を減算します。

source: Successful compilation of a library or a binary.
ja: ライブラリまたはバイナリのコンパイルに成功した。

source: Support on amd64 and i386 is tested regularly, while less popular platforms are tested by the community.
ja: amd64 と i386 のサポートのテストは定期的に行われています。それ以外のあまり一般的ではないプラットフォームはコミュニティでテストが行われています。

source: Supported architectures
ja: アーキテクチャのサポート

source: Supports IPv4 and v6.
ja: IPv4 と v6 に対応しています。

source: Suspends the process p.
ja: プロセス p を一時停止します。

source: Symbolic link.
ja: シンボリックリンク。

source: Syntax
ja: シンタックス

source: Syntax errors raise an SqlParseError exception.
ja: シンタックスエラーでは SqlParseError 例外が発生します。

source: Syntax sugar for anonymous procedures.
ja: 無名プロシージャのシンタックスシュガーです。

source: Syntax sugar for procedure types.
ja: プロシージャ型のシンタックスシュガーです。

source: Takes an integer and outputs as many indented "hello world!"s
ja: "hello world!" の出力回数を整数で指定してインデント付きで表示します。

source: Template based implementation of singly and doubly linked lists.
ja: 単方向・双方向リストのテンプレートベースによる実装です。

source: Template declaration
ja: テンプレート宣言

source: Template which expands to either stdout or stderr depending on useStdoutAsStdmsg compile-time switch.
ja: コンパイル時スイッチ useStdoutAsStdmsg の指定時に stdout または stderr を展開するためのテンプレートです。

source: Templates
ja: テンプレート

source: Terminates the async http server instance.
ja: 非同期 http サーバのインスタンスを終了します。

source: Termination signal, iff WIFSIGNALED(s) Source Edit
ja: WIFSIGNALED の場合に限り、終結シグナルとなります ソース 編集

source: Test for a block special file.
ja: ブロック専用ファイルをテストします。

source: Test for a character special file.
ja: キャラクタ専用ファイルをテストします。

source: Test for a directory.
ja: ディレクトリをテストします。

source: Test for a message queue.
ja: メッセージキューをテストします。

source: Test for a pipe or FIFO special file.
ja: パイプまたは FIFO 専用ファイルをテストします。

source: Test for a regular file.
ja: 通常ファイルをテストします。

source: Test for a semaphore.
ja: セマフォをテストします。

source: Test for a shared memory object.
ja: 共用メモリオブジェクトをテストします。

source: Test for a socket.
ja: ソケットをテストします。

source: Test for a symbolic link.
ja: シンボリックリンクをテストします。

source: Test macro for a typed memory object.
ja: 型付きメモリオブジェクトのテスト用マクロです。

source: Tested on these OSes: Linux, Windows, OSX
ja: テスト済み OS : Linux, Windows, OSX

source: That constrains reasonable uses of this routine unless written as part of a conditional replacement:
ja: このルーチンを使うにあたって条件付き置換の一部が記述されていないならば合理的な制約が課せられます:

source: That is, using the ? (question mark) to signify the place where a value should be placed.
ja: つまり、値の置換先を表すのに ? (疑問符) を使います。

source: The "Hot code reloading" feature is built into the compiler but has its own document explaining how it works.
ja: 「ホットコード・リローディング」機能はコンパイラに内蔵されています。このドキュメンテーションでは、この機能に関する動作の仕組みを解説しています。

source: The "compiler" directory contains compiler sources and should not be part of the compiler binary package
ja: "compiler" ディレクトリにはコンパイラのソースがありますが、これはコンパイラのバイナリパッケージへの収録対象ではありません。

source: The boot command bootstraps the compiler, and it accepts different options:
ja: boot コマンドはコンパイラのブートストラップです。ビルドオプションを指定できます。

source: The csource command builds the C sources for installation.
ja: csource コマンドはインストール用の C ソースをビルドします。

source: The koch program is Nim's maintenance script.
ja: koch プログラムは Nim のメンテナンス・スクリプトです。

source: The test command can also be invoked with the alias tests.
ja: test コマンドは tests コマンドを呼び出すためのエイリアスです。

source: The web command converts the documentation in the doc directory from rst to HTML.
ja: web コマンドは doc ディレクトリにある rst 形式のファイルを HTML 形式のドキュメンテーションへ一括変換します。

source: The --parallelBuild:n switch or configuration option can be used to force a specific number of parallel jobs or run everything serially from the start (n == 1).
ja: --parallelBuild:n スイッチやコンフィギュレーションオプションは並列ジョブ数の強制指定、または起動から一貫して直列ジョブで実行するために使います (n == 1)。

source: The UnixBin section currently only supports the files key.
ja: 現在、 UnixBin セクションでは files キーのみサポートしています。

source: The config section currently only supports the files key.
ja: config セクションでは files キーのみサポートしています。

source: The doc command:
ja: doc コマンド:

source: The documentation section supports the files key.
ja: documentation セクションでは files キーのみサポートしています。

source: The heapqueue module implements a heap data structure that can be used as a priority queue.
ja: heapqueue モジュールは優先順位付きキューとして使えるヒープによるデータ構造の実装です。

source: The init proc can be called with any number of arguments, i.e. initTable(initialSize).
ja: 換言すれば、 initTable(initialSize) といったように init プロシージャには引数を何個でも与えて呼び出せます。

source: The jsondoc0 command:
ja: jsondoc0 コマンド:

source: The jsondoc command:
ja: jsondoc コマンド:

source: The lib section currently only supports the files key.
ja: 現在、 lib セクションでは files キーのみサポートしています。

source: The other section currently only supports the files key.
ja: 現在、 other セクションでは files キーのみサポートしています。

source: The parsesql module implements a high performance SQL file parser.
ja: parsesql モジュールは高性能な SQL ファイルのパーサー実装です。

source: The send operation will block until number of unprocessed items is less than maxItems.
ja: 未処理アイテム件数が maxItems 以下になるまで send 処理をブロックします。

source: The uiApp parameter is Windows specific.
ja: uiApp パラメータは Windows 専用です。

source: The windows section supports the files key for Windows specific files.
ja: windows セクションではWindows 専用ファイルのみで使える files キーをサポートしています。

source: The EvRetr event is passed to the specified handleEvent function when the download is finished.
ja: ダウンロードが完了すると指定された handleEvent 関数 に EvRetr イベントが渡されます。

source: The EvStore event is passed to the specified handleEvent function when the upload is finished, and the filename field will be equal to file.
ja: アップロードが完了すると指定された handleEvent 関数 に EvStore イベントが渡されます。 なお、イベントの filename フィールドは file と同じです。

source: The API is designed to be easy to use and consistent.
ja: API は使いやすさと整合性を目的とした設計にしてあります。

source: The AST in Nim
ja: Nim の抽象構文木 (AST)

source: The CPU this build is running on.
ja: このビルドを実行している CPU の種類です。

source: The Debian package ships bash and ksh completion and manpages that can be reused.
ja: Debian パッケージには再利用可能な bash と ksh のシェル補完、および man ページが収録されています。

source: The HTML parser already converts entities to UTF-8.
ja: HTML 構文解析器は既存のエンティティを UTF-8 へ変換します。

source: The MinGW-w64 toolchain can be installed as follows:
ja: MinGW-w64 ツールチェーンは下記の手順でインストールします:

source: The Nim compiler supports source code filters as a simple yet powerful builtin templating system.
ja: Nim コンパイラはシンプルだが強力な内蔵型テンプレートシステムとしてソースコードフィルタをサポートしています。

source: The Nim manual is a draft that will evolve into a proper specification.
ja: Nim マニュアルは改訂が続けられている草稿段階の公式仕様書です。

source: The Nim project's directory structure is:
ja: Nim プロジェクトのディレクトリ構造は、

source: The Nim tutorial part one deals with the basics.
ja: Nim チュートリアル 第１部では基本事項について解説しています。

source: The Nim tutorial part three about Nim's macro system.
ja: Nim チュートリアル 第３部では Nim のマクロシステムについて解説しています。

source: The Nim tutorial part two deals with the advanced language constructs.
ja: Nim チュートリアル 第２部では高度な言語構造について解説しています。

source: The Nintendo Switch requires this call in order to make use of memory, otherwise an invalid memory access occurs.
ja: Nintendo Switch でメモリを利用するには、この関数の呼び出しが必要であり、そうしなかった場合は不正なメモリアクセスが発生します。

source: The OS this build is running on.
ja: このビルドを実行しているオペレーティング・システムです。

source: The Switch will expect all memory to be allocated before gfxExit() calls (<switch/gfx/gfx.h>)
ja: Nintendo Switch では gfxExit() の呼び出し前にメモリをすべて割り当てることが求められます (<switch/gfx/gfx.h>)

source: The URL must not be empty string, to open on a blank page see openDefaultBrowser().
ja: URL には空文字を指定できません。空ページを開くには openDefaultBrowser() を参照してください。

source: The above output could be the result of a code snippet like:
ja: 上述の出力結果によるコードスニペットは、

source: The addr operator
ja: addr 演算子

source: The algorithm itself is comparing 2 arrays of numbers so when comparing 2 text documents each line is converted into a (hash) number.
ja: アルゴリズムの処理方法はテキストドキュメント同士の比較時に各行を数値 (ハッシュ) へ変換してから数値配列同士を比較しています。

source: The assignment statement
ja: 代入ステートメント

source: The basic flow of using this module is:
ja: このモジュールを使うための基本手順は、

source: The buffer will be able to grow up to the size of the initially reserved portion of the address space.
ja: バッファはアドレス空間で初期予約された割り当てサイズまで拡張可能です。

source: The buffer z must be at least 9 characters long to accommodate the largest possible varint.
ja: バッファ z は最大利用可能 varint を扱うために最低でも 9 文字になります。

source: The builtin document generator nim doc generates HTML documentation from .nim source files.
ja: 内蔵型ドキュメントジェネレータ nim doc は .nim ソースファイルから HTML ドキュメンテーションを生成します。

source: The callback is also called when the future is completed.
ja: Future の完了後にもコールバックが呼び出されます。

source: The callback should return one of:
ja: コールバックとして返されるものは、

source: The change is permanent for the rest of the execution, since this is just a shortcut for os.setCurrentDir() .
ja: これは os.setCurrentDir() のショートカットであるため、実行後の変更は恒常的となります。

source: The character is not printed to the terminal.
ja: 入力された文字はターミナルで表示されません。

source: The circle constant PI (Ludolph's number) Source Edit
ja: The circle constant PI (Ludolph's number) ソース 編集

source: The circle constant TAU (= 2 * PI) Source Edit
ja: The circle constant TAU (= 2 * PI) ソース 編集

source: The client data field is used by the HTML parser and generator.
ja: クライアントのデータフィールドは HTML パーザーとジェネレータで使います。

source: The code contains a confusing var declaration.
ja: 紛らわしい var 定義がコードにある。

source: The code contains an unsupported octal sequence.
ja: 非対応の八進数シーケンスがコードにある。

source: The code uses a deprecated symbol.
ja: 廃止されたシンボルをコードで使用している。

source: The compiler may not generate any code at all for assert if it is advised to do so through the -d:danger or --assertions:off command line switches.
ja: コンパイラで assert のコードを一切生成しないようにするには、コマンドラインスイッチとして -d:danger または --assertions:off を渡すことをお勧めします。

source: The compiler's architecture
ja: コンパイラのアーキテクチャ

source: The connection will complete asynchronously and the client will be connected after the await ftp.connect() call.
ja: 接続は非同期で完了します。また、クライアントは接続後に await ftp.connect() 呼び出しを待機します。

source: The crit bit tree can either be used as a mapping from strings to some type T or as a set of strings if T is void.
ja: crit ビットツリーは文字列から T 型に対する写像、または T が void のときは文字列集合として使えます。

source: The current implementation also has a bug that affects symbol binding in the loop body.
ja: なお、現在の実装にはループ本体のシンボル・バインディングに悪影響を及ぼすバグがあります。

source: The current implementation uses PCRE.
ja: 現在の実装では PCRE を採用しています。

source: The currently handled signal is injected as sig into the calling scope.
ja: 現在の実装では処理されたシグナルは sig として呼び出しスコープへ注入されます。

source: The data which is read is written to the file immediately and freed from memory.
ja: 読み取られたデータは直ちにファイルへ書き込みを行い、メモリから削除されます。

source: The database will contain the most common mimetypes.
ja: 一般によく使われる mimetypes をデータベースを収録してあります。

# The default compiler is defined at the top of config im.cfg.
source: The default compiler is defined at the top of config\nim.cfg.
ja: デフォルトのコンパイラ構成は config\nim.cfg の先頭に定義されています。

source: The directory is created with permissions 0700.
ja: ディレクトリはパーミッション 0700 で作成されます。

source: The documentation consists of several documents:
ja: このようなドキュメンテーションがあります。

source: The empty string will be returned as a minimum.
ja: 空文字列は最小値として返されます。

source: The event's filename field will be equal to file.
ja: なお、イベントの filename フィールドは file と同じです。

source: The exact location depends on the installation path the user specifies when running the install.sh script.
ja: 正確な格納先はユーザが install.sh スクリプトを実行するときに指定するインストール先のパス次第です。

source: The existing file will not be cleared.
ja: 既存ファイルは消去されません。

source: The expected stdlib location is /usr/lib/nim
ja: stdlib の所在は /usr/lib/nim にあると仮定します

source: The file is created with perms 0600.
ja: ファイルはパーミッション 0600 で作成されます。

source: The file mode when opening a file.
ja: ファイルを開くとき指定するファイルモードです。

source: The file's first byte has the index zero.
ja: ファイルの先頭バイト位置はインデックス 0 です。

source: The first program
ja: 最初のプログラム

source: The following example demonstrates loading a function called 'greet' from a library that is determined at runtime based upon a language choice.
ja: この用例は実行時に言語の選出に基づいて決定されたライブラリから 'greet' 関数をロードします。

source: The following example file has been generated by profiling the Nim compiler itself: It shows that in total 5.4% of the runtime has been spent in crcFromRope or its children.
ja: 下記のファイル出力例は Nim コンパイラ側のプロファイリング機能により生成したものです。これによりランタイム全体の 5.4% が crcFromRope またはその子供の処理に費やされたことが明らかとなります。

source: The following is a simple example of two different ways to use channels: blocking and non-blocking.
ja: このサンプルはチャンネルの二通りの使い方を記したものです: ブロッキングとノンブロッキングです。

source: The following platforms are seldomly tested:
ja: 次のプラットホームのテストは全く行われていません。

source: The full output can be seen here: docgen_sample.html.
ja: 完全版の出力は docgen_sample.html を参照してください。

source: The future stream is completed (this means that no more data will be written).
ja: Future ストリームの処理が完了するとき (これは書き出すデータがないことを意味します)。

source: The future will be completed with the oldest value stored inside the stream.
ja: ストリームへ格納された最古値により Future を完了します。

source: The gamma function Source Edit
ja: The gamma function ソース 編集

source: The generated HTML for some of these wrappers is so huge that it is not contained in the distribution.
ja: ラッパー用に生成された HTML ドキュメントは巨大なためディストリビューションには収録していません。

source: The generated index.
ja: 自動生成の索引です。

source: The getrlimit() system call gets resource limits.
ja: システムコール getrlimit() はリソース制限を取得します。

source: The highest (absolute) return value of all processes is returned.
ja: 全プロセスで最も高いものの値 (確実に) を返します。

source: The initial whitespace is skipped.
ja: 頭文字にあるホワイトスペースは無視します。

source: The installers for the Nim compiler itself are generated by niminst.
ja: Nim コンパイラのインストーラは niminst で生成されます。

source: The interesting property of a heap is that a[0] is always its smallest element.
ja: ヒープの興味深い性質として a[0] は必ず最小要素になることです。

source: The interface supports one language nested in another.
ja: ある言語へ別の言語をネストすることもインターフェースでサポートしています。

source: The internal documentation describes how the compiler is implemented.
ja: コンパイラの内部構造ではコンパイラの実装方法を解説してあります。

source: The involved types should have 'prev' or 'next' fields and the list header should have 'head' or 'tail' fields.
ja: 関連する型は 'prev' または 'next' フィールド、およびリストのヘッダは 'head' または 'tail' フィールドにしてください。

source: The last statement of body has special syntax that specifies the collection's add operation.
ja: body の最後にあるステートメントはコレクションへの add 操作を指示するための特別なシンタックスです。

source: The let statement
ja: let ステートメント

source: The letter 'l' should not be used as an identifier.
ja: 小文字 'l' は識別子として使わないでください。

source: The library uses a simple naming scheme that makes use of common abbreviations to keep the names short but meaningful.
ja: シンプルな命名体系となるよう名前が短く意味が通じるもので一般的によく使われる略語をライブラリで採用しています。

source: The newline character(s) are not part of the returned string.
ja: 改行文字は返された文字列の一部ではありません。

source: The newline character(s) are not part of the returned strings.
ja: 改行文字は返された文字列の一部ではありません。

source: The only case where things aren't as easy is when the garbage collector needs some assembler tweaking to work.
ja: 唯一、難しいのはガーベジ・コレクタ処理箇所でのアセンブラ言語による微調整が必要なときです。

source: The output for HTML and LaTeX comes from the config/nimdoc.cfg and config/nimdoc.tex.cfg configuration files.
ja: HTML と LaTeX の出力時、config/nimdoc.cfg と config/nimdoc.tex.cfg をコンフィギュレーション・ファイルとして参照します。

source: The parser builds a syntax tree that is used by the code generator.
ja: パーサはコードジェネレータで使うシンタックスツリーを構築します。

source: The proc getSourceLanguage can get the language enum from a string:
ja: getSourceLanguage プロシージャにより文字列から言語 enum を得られます。

source: The proc is meant to parse the Cookie header set by a client, not the "Set-Cookie" header set by servers.
ja: このプロシージャはサーバで設定された "Set-Cookie" ヘッダではなく、クライアントで設定された Cookie ヘッダの解析を行います。

source: The profiler is embedded into your executable.
ja: プロファイラは実行可能ファイルに組み込まれます。

source: The program should output something similar to this, but keep in mind that exact results may vary in the real world:
ja: この結果と同じものをプログラムで出力しますが、想定している正確な結果と実際の結果は異なる場合があることをお断りしておきます。

source: The progress of either a file upload or a file download can be checked by specifying a onProgressChanged procedure to the store or retrFile procedures.
ja: ファイルのアップロード、またはダウンロードの進捗状況を確認するには onProgressChanged プロシージャへ store または retrFile プロシージャを指定します。

source: The project makes use of a deprecated config file.
ja: 廃止されたコンフィギュレーション・ファイルをプロジェクトで使用している。

source: The project section gathers general information about your project.
ja: Project セクションはプロジェクトに関する概要を収集したものです。

source: The reasoning is as follows:
ja: これは下記の論拠によるものです:

source: The removal of existing files.
ja: 既存ファイルの削除。

source: The resulting C code will just #include <XYZ.h> and not define the symbols declared here.
ja: これにより C コードは #include <XYZ.h> などを生成しますが、宣言したシンボルは定義されません。

source: The results file lists stack traces ordered by significance.
ja: 分析結果のファイルには重要度で順序付けられたスタックトレースのリストがあります。

source: The return value will also determine whether data was retrieved, false means that the future stream was completed and no data was retrieved.
ja: 返値は取得したか判定するためのものであり、 false ならば Future ストリームは完了しておりデータは取得できていません。

source: The returned Future will complete once all data has been written to the specified file.
ja: 指定されたファイルへの全データ一括書き込み完了後に Future が返されます。

source: The same as result.add(escape(s)), but more efficient.
ja: result.add(escape(s)) と同じですが、こちらのほうが効率的です。

source: The same interface is implemented for other databases too.
ja: そのほかのデータベース実装でもインタフェースは共通化してあります。

source: The serialization format uses JSON.
ja: シリアライゼーション形式は JSON です。

source: The server will respond to all requests with a 200 OK response code and "Hello World" as the response body.
ja: このサーバは、すべてのリクエストにレスポンスコ―ド 200 OKを、 本文 (body) は "Hello World" で応答します。

source: The setrlimit() system calls sets resource limits.
ja: システムコール setrlimit() はリソース制限を設定します。

source: The setting --profiler:on defines the conditional symbol profiler.
ja: --profiler:on を設定するとシンボル profiler (プロファイラ) を定義します。

source: The source line that triggered a diagnostic message.
ja: 診断メッセージが発生したソースの行。

source: The standard distribution ships with the following tools:
ja: 標準ディストリビューションには下記のツールを収録しています。

source: The standard error stream.
ja: 標準エラー出力のストリーム。

source: The standard handler writes an error message and terminates the program, except when using --os:any Source Edit
ja: The standard handler writes an error message and terminates the program, except when using --os:any ソース 編集

source: The standard input stream.
ja: 標準入力のストリーム。

source: The standard output stream.
ja: 標準出力のストリーム。

source: The standard version of the GC uses C's setjmp function to store all registers on the hardware stack.
ja: ガーベジ・コレクタの標準版では全レジスタをハードウェア・スタックへストアするために C の setjmp関数を使います。

source: The stdlib API is designed to be easy to use and consistent.
ja: stdlib API は使いやすさと整合性を目的とした設計にしてあります。

source: The stringify operator for a CString argument.
ja: CString 型引数用の文字列化 (stringify) 演算子です。

source: The stringify operator for a boolean argument.
ja: ブール型引数用の文字列化 (stringify) 演算子です。

source: The stringify operator for a character argument.
ja: 文字型引数用の文字列化 (stringify) 演算子です。

source: The stringify operator for a float argument.
ja: 浮動小数型引数用の文字列化 (stringify) 演算子です。

source: The stringify operator for a string argument.
ja: 文字列型引数用の文字列化 (stringify) 演算子です。

source: The stringify operator for an enumeration argument.
ja: 列挙型引数用の文字列化 (stringify) 演算子です。

source: The stringify operator for an integer argument.
ja: 整数型引数用の文字列化 (stringify) 演算子です。

source: The temp command builds the Nim compiler but with a different final name (nim_temp), so it doesn't overwrite your normal compiler.
ja: temp コマンドは、標準コンパイラを上書きせずに一時ファイル名 (nim_temp) で Nim コンパイラをビルドします。

source: The trailing newline character(s) are removed from the iterated lines.
ja: 末尾にある改行文字はイテレートされた行から削除されます。

source: The type representing a file handle.
ja: ファイルハンドル型。

source: The ultimate goal is that the programmer can guess a name.
ja: 最終目標はプログラマが名前から機能や用途を推測可能にすることです。

source: The unsafeAddr operator
ja: unsafeAddr 演算子

source: The upload of new files.
ja: 新しいファイルのアップロード。

source: The user guide lists command line arguments, special features of the compiler, etc.
ja: ユーザーガイドではコマンドライン引数のリスト、コンパイラの特色などを解説しています。

source: The value can be modified.
ja: 値は修正可能です。

source: The value of a key-value pair can reference user-defined variables via the $variable notation: They can be defined in the command line with the --var:name=value switch.
ja: キー・値から成るペア値を参照します。 $variable 記法によるユーザ定義変数: これはコマンドラインスイッチ --var:名前=値 スイッチで定義可能です。

source: The values can be modified.
ja: 値は修正可能です。

source: The var statement
ja: var ステートメント

source: The word koch means cook in German.
ja: koch の由来はドイツ語であり、日本語で料理人の意味です。

source: The x position is not changed.
ja: x 座標は変更されません。

source: The y position is not changed.
ja: y 座標は変更されません。

source: The yielded values can be modified.
ja: 生成値は修正可能です。

source: Then writes the content completely to the file and closes the file afterwards.
ja: その後、ファイルの内容として content を完全に書き込んでからファイルを閉じます。

source: There is a start key which determines whether the Windows installer generates a link to e.g. the index.html of your documentation.
ja: Windows インストーラでは、ドキュメンテーションの index.html などのリンク生成を指定で使う start キーがあります。

source: They are unstable when used with spawn
ja: spawn との併用時は動作が不安定になります。

source: They may span multiple lines.""" --"long option with spaces": r"c:\myfiles\test.txt"
ja: これは複数行に またがることができます。""" --"空白文字のある長いオプション": r"c:\myfiles\test.txt"

source: This HTTP server has not been designed to be used in production, but for testing applications locally.
ja: この HTTP サーバは本番環境での運用を想定した設計ではなく、ローカル環境でのアプリケーションテスト用に設計してあります。

source: This blocks until a message has arrived!
ja: からメッセージを受信します。

source: This can be called multiple times in a given PFrame.
ja: これは指定の PFrame を複数回呼び出します。

source: This can be done using, for example, newString.
ja: この処理は newString などで行えます。

source: This can be used in the callback set in SSL_CTX_set_tlsext_servername_callback to implement virtual hosting.
ja: これは SSL_CTX_set_tlsext_servername_callback に設定されたコールバックでありバーチャルホスティングの実装で使われます。

source: This can only simulate the 'GET' request method.
ja: これは 'GET' リクエスト・メソッドのシミュレート専用です。

source: This checks that each variable name of the CGI data occurs in the validKeys array.
ja: これは CGI data (データ) における個々の変数名が validKeys 配列に存在するか確認します。

source: This closes L's associated stream too.
ja: これは L 関連のストリームも閉じられます。

source: This code demonstrates how you can iterate over all the tags in an HTML file and write back the modified version.
ja: このコードでは HTML ファイルにある全タグのイテレート、および変換版の書き戻しかたを説明しています。

source: This combination should suffice to produce a globally distributed unique ID.
ja: この組み合わせはグローバル型の分散固有 ID を生成するのに不足はありません。

source: This command will compile and run testament/tester.nim, which is the main driver of Nim's test suite.
ja: このコマンドは Nim のテストスイートにおけるメインドライバです。 testament/tester.nim のコンパイル、および実行します。

source: This controls the parser.
ja: これはパーサーを制御します。

source: This document describes Nim's standard library.
ja: このドキュメントでは Nim の標準ライブラリについて解説しています。

source: This document describes the documentation generation tools built into the Nim compiler, which can generate HTML and JSON output from input .nim files and projects, as well as HTML and LaTeX from input RST (reStructuredText) files.
ja: このドキュメントは Nim コンパイラ に搭載のドキュメント生成ツールについて説明しています。このツールは .min ファイルやプロジェクトファイルを入力して HTML と JSON を出力したり、 RST (reStructuredText) ファイルを入力して LaTeX と HTML を出力することもできます。

source: This document describes the supported commands and their options.
ja: このドキュメントでは koch のコマンドとオプションを説明します。
